fraserb99/ee579-msp430/Group Project/main.c
#include <msp430.h> 


/**
 * main.c for Group 4
 *
 *
 * based on previous challenges and examples from TI code
 */

//button stuff
unsigned int timerCount = 0;            //initial count for the wait time
unsigned int pressed = 0;               //checking for pressed state, used for debouncing
unsigned int held = 0;                  //checking if the button is being pressed/held
const int debounce_b = 41;              //count for the 50Hz, based on 32768/(16*x)= 50, want a 20ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b = 102;                //count for the count for presses, rate of 20Hz, based on 32768/(16x) = 20Hz
int activated_button[];                 //indicator for activated timer for the button

//potentiometer stuff
unsigned int orig_val = 0;              //Setting up value for original potentiometer vale
unsigned int value = 0;                 //value on check
signed int change = 0;                  //value to check how much the pot has changed
const int step_size = 10;               //value to indicate step size

//temp stuff
signed int orig_temp = 0;              //Setting up value for original potentiometer vale
signed int value_temp = 0;             //value on check
unsigned int temp = 0;
signed long change_t = 0;               //value to check how much the pot has changed
const int step_size_t = 5;              //value to indicate step size
unsigned int stable = 0;                //boolean for determining if stable Vref
unsigned int sample_temp = 0;           //boolean to be used to indicate a sample should be taken
const int sample_temp_time = 2048;     //used for sample time of the temperature 16384/8
int activated_temp[];                   //indicator for activated timer for the temperature

//LED1 stuff
unsigned int blink_rate_1 = 4096;      //rate for the blinking light of LED D1, default set to period of 0.5Hz, 32768/(16x) = 0.5Hz
signed int light_flag_1 = 0;            //breathing and fading light flag, brighter or darker,  brighter = 1, darker = -1;
signed int brightness_1 = 0;            //used for determining brightness, initially between 0 and 4
unsigned int flash_count_1 = 0;         //LED counter
unsigned int duty_cycle_1 = 1;          //duty cycle for breathing and flashing, default of 2048Hz
unsigned int peroid_1 = 516;           //period for flashing and breathing, default 16Hz
int activated_led1[];                   //Array for activated timers for LED D1

//LED2 stuff
unsigned int blink_rate_2 = 4096;      //rate for the blinking light of LED D2, default period 0.5Hz
signed int light_flag_2 = 0;            //breathing and fading light flag, brighter or darker,  brighter = 1, darker = -1;
signed int brightness_2 = 0;            //used for determining brightness, initially between 0 and 4
unsigned int flash_count_2 = 0;         //LED counter
unsigned int duty_cycle_2 = 1;          //duty cycle for breathing and flashing, default of 2048Hz
unsigned int peroid_2 = 1024;           //period for flashing and breathing, default 16Hz
int activated_led2[0];                  //Array for activated timers for LED D2

//LED3 stuff
//define all the colours
#define RED (BIT1)
#define GREEN (BIT3)
#define BLUE (BIT5)
#define YELLOW (BIT1 + BIT3)
#define PURPLE (BIT1 + BIT5)
#define CYAN (BIT3 + BIT5)
#define WHITE (BIT1 + BIT3 + BIT5)
const int colours[] = {RED, GREEN, BLUE, YELLOW, PURPLE, CYAN, WHITE};    //Array for the colours
unsigned int colour = 0;                //The colour selected
unsigned int blink_rate_3 = 4096;       //rate for the blinking light for LED D3, or rotating, default 0.5Hz
signed int light_flag_3 = 0;            //breathing and fading light flag, brighter or darker,  brighter = 1, darker = -1;
signed int brightness_3 = 0;            //used for determining brightness, initially between 0 and 4
unsigned int flash_count_3 = 0;         //LED counter
unsigned int duty_cycle_3 = 2;          //duty cycle for breathing and flashing, default of 2048Hz
unsigned int peroid_3 = 2048;           //period for flashing and breathing, default of 16Hz
int activated_led3[];     //Array for activated timers for the color led

//Check digits for the components
//inputs
signed int button = -1;                 //Button
unsigned int b_activated = 0;           //boolean for denoting button activation
unsigned int pot = 0;                   //Potentiometer
unsigned int pot_activated = 0;         //boolean for denoting potentiometer activation
signed int thermometer = -1;             //thermometer
unsigned int t_activated = 0;           //boolean for denoting thermometer activation
unsigned int switch1 = 0;               //switch 1
unsigned int sw1_activated = 0;         //boolean for denoting switch 1 activation
unsigned int switch2 = 0;               //switch 2
unsigned int sw2_activated = 0;         //boolean for denoting switch 2 activation
//outputs
signed int led1_on = 0;               //LED D1 on, 0 indicate off, -1 - deactivate
unsigned int led1_active = 0;           //check if the light has been activated - can only have one setting on at a time
signed int led1_blink = -1;            //LED1 blinking light
signed int led1_fade_in = -1;            //LED1 fade in
signed int led1_fade_out = -1;         //LED1 fade out
signed int led1_breath = -1;           //LED1 blinking light
signed int led2_on = 0;               //LED D2 on
unsigned int led2_active = 0;           //LED2 active
signed int led2_blink = -1;             //LED2 blink
signed int led2_fade_in = -1;          //LED2 fade in
signed int led2_fade_out = -1;         //LED2 fade out
signed int led2_breath = -1;           //LED2 blinking light
signed int led3_on = 0;               //LED D3 on, colour light
unsigned int led3_active = 0;           //LED3 active
signed int led3_rot = -1;               //rotate led3
signed int led3_dir = 0;                //LED3 direction of rotation, -1 for backwards and 1 for forwards
signed int led3_blink = -1;              //LE3 blink
unsigned int led3_blink_on = 0;         //used to indicate on or off light
signed int led3_fade_in = -1;          //LED3 fade in
signed int led3_fade_out = -1;         //LED3 fade out
signed int led3_breath = -1;           //LED3 blinking light
unsigned int buzzer_sus = 0;            //buzzer sustained tone
unsigned int buzzer_beep = 0;           //buzzer beeping

//array for timer usage, 0 if not used, 1 if used 0, pos 0:TA0_0, 1:TA0_1, 2:TA0_2, 3:TA1_0, 4: TA1_1, 5:TA1_2
unsigned int timers_used[6] = {0, 0, 0, 0, 0, 0};
unsigned int timer0_activated = 0;      //Boolean used for checking if TA0 has been activated
unsigned int timer1_activated = 0;      //Boolean used for checking if TA1 has been activated
signed int activated_timers[2] = {-1, -1};   //array for activated timers for each activation

//array for used lights If 1 means active, if 0 not active, Returns array of status for each light, pos0 = D1, pos1 = D2, pos3 = D3
unsigned int lights_used[3] = {0, 0, 0};


