fraserb99/ee579-msp430/Group Project/main.c
//declare helper functions
int activate_timer(int timer_no, int count1, int count2);       //function for activating a specific timer
int activate_free_timer(int registers, int counts[]);           //function for activating required number of free timers
void deactivate_timer(int activated[], int len);                //deactivate unused timers
int get_timer_code(int timers[]);                               //get the specific timer code for 2 timers


//TODO: Add interrupts for breathing LEDs.

//main function
int main(void)
{
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer

	//stuff for testing
	//P1DIR |= BIT0 + BIT6;      // P1.0, P1.6 output
	//P2DIR |= BIT1;             //utilise D3
	//button = 1;
	//pot = 1;
	//thermometer = 1;
	led1_fade_in = 1;
	//blink_rate_3 = 32768;
    //led1_blink = -1;

	__bis_SR_register(GIE);                     //interrupt enabled

    while(1){
        //read messages here


        //input
        //check if button was requested
        if (button > -1){
            if (!b_activated){ //if not already activated
                //button set up, from slides and previous challenge
                P1OUT |= BIT3;                            //pull up resistor on P1.3
                P1REN |= BIT3;                            //Enable it
                P1IES |= BIT3;                            //high to low edge
                P1IFG &= ~BIT3;                           // Clear flag
                P1IE |= BIT3;                             //Interrupt enable

                int counts[1] = {debounce_b};
                b_activated = activate_free_timer(1, counts);
                //record which ones were activated
                activated_button[0] = activated_timers[0];
                button = activated_button[0];                //assign to check properly for timer interrupts
                if (b_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }
        } else if(button == -2){
            b_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button, 2);   //turn off timer
            P1IE &= ~BIT3;                          //and button interrupt
            button = -1;
        }

        //need checks to see if potentiometer was requested
        if (pot){
            if(!pot_activated){ //if not already activated
                ADC10CTL0 = ADC10ON + CONSEQ_0;            // ADC10ON, single channel single sample
                ADC10CTL1 = INCH_1 + ADC10SSEL_1;          // input A1, clock = ACLK
                ADC10AE0 |= BIT1;                          // PA.1 ADC option select

                //get original value
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                orig_val = ADC10MEM;
                pot_activated = 1;
            }

            ADC10CTL1 = INCH_1;                     //Ensure right channel
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            //ADC10MEM = conversion result
            //wait for result completion, triggers interrrupt when done, ADC10Iflag
            while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                //Wait for sample to take place
            }
            value = ADC10MEM;           //Just to make sure the value doesn't change during checking
            //reset ENC
            ADC10CTL0 &= ~ENC;

            if(value != orig_val){ //if value has changed
                //check by how much
                change = abs(orig_val - value);

                if (change >= step_size){
                    //send message
                    //testing light
                    P2OUT ^= BIT1;
                }

                orig_val = value; //change to new orig value

            }
            //Code here for the potentiometer, so basically send stuff at interval checks
        } else {
            pot_activated = 0;
        }

        //check if thermometer was requested
        if(thermometer > -1){
            //based on example adc10_temp.c from URL: http://dev.ti.com/tirex/explore/node?node=AEldOKIXgnT979MckUlLRw__IOGqZri__LATEST
            if(!t_activated){
                ADC10CTL0 = ADC10ON + SREF_1 + REFON;      // ADC10ON, vr+ = Vref+f, Vr- = Vss, reference on,
                ADC10CTL1 = INCH_10 + ADC10SSEL_1;         // temp sensor, clock = ACLK
                ADC10AE0 |= BIT1;                          // PA.1 ADC option select

                //set up a timer for stabilisation, use A1
                //need a 30microsecond delay calculation time was 0.49, putting 10 to test, need only 1 timer
                int counts[1] = {10};
                t_activated = activate_free_timer(1, counts);
                activated_temp[0] = activated_timers[0];      //record which ones were activated
                thermometer = activated_temp[0];              //Set for proper check in interrupts
                if (t_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
            }

            if (sample_temp){
                ADC10CTL1 = INCH_10;                //Ensure right channel
                ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                //based on code for pot above
                //ADC10MEM = conversion result
                while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                    //Wait for sample to take place
                }
                temp = ADC10MEM;           //Just to make sure the value doesn't change during checking
                //reset ENC
                ADC10CTL0 &= ~ENC;
                value_temp = ((temp - 673) * 423) / 1024;

                if(value_temp != orig_temp){ //if value has changed
                    //check by how much
                    change_t = abs(orig_temp - value_temp);

