fraserb99/ee579-msp430/Group Project/main.c
                    if (change_t >= step_size_t){
                        //send message
                        //testing light
                        //P1OUT ^= BIT6;
                    }
                }
                orig_temp = value_temp; //change to new orig value
                //set sample to false
                sample_temp = 0;
            }


        } else if(thermometer == -2){
            t_activated = 0;
            deactivate_timer(activated_temp, 1);
            thermometer = -1;
        }

        //check switch 1
        if(switch1){
            if(!sw1_activated){

                sw1_activated = 1;
            }
        } else {
            sw1_activated = 0;
        }

        //check switch 2
        if(switch2){
            if(!sw2_activated){

                sw2_activated = 1;
            }
        } else {
            sw2_activated = 0;
        }

        //Outputs
        //LED1
        //on/off
        if(led1_on){
            if (!led1_active) {
              P1DIR |= BIT0;        // P1.0 output
              //toggle LED D1
              P1OUT ^= BIT0;
            }

        } else if(led1_on == -1) {
            //P1OUT &= ~BIT0;         //turn light off
            led1_active = 0;        //not active anymore
        }

        //blinking
        if(led1_blink > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led1_active = activate_free_timer(1, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated
                led1_blink = activated_led1[0];
                if (led1_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D1
                P1OUT ^= BIT0;
            }

        } else if (led1_blink == -2){
            led1_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led1, 1);
            led1_blink = -1;
        }

        //fade in
        if(led1_fade_in > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_1, duty_cycle_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_in = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to 1
                    light_flag_1 = 1;
                }

            }

        } else if (led1_fade_in == -2){
            led1_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_fade_in = -1;
        }

        //fade out
        if(led1_fade_out > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_1, duty_cycle_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_out = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to -1
                    light_flag_1 = -1;
                }

            }

        } else if (led1_fade_out == -2){
            led1_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_fade_out = -1;
        }

        //breathing
        if(led1_breath > -1){
            if(!led1_active){
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_1, duty_cycle_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_breath = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to 1
                    light_flag_1 = 1;
                }

            }

        } else if (led1_breath == -2){
            led1_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_breath = -1;
        }

        //LED2 on/off
        if(led2_on){
            if (!led2_active) {
              P1DIR |= BIT6;        // P1.6 output
              //toggle LED D2
              P1OUT ^= BIT6;
            }

        } else if(led2_on == -1){
            P1OUT &= ~BIT6;         //turn light off
            led2_active = 0;        //not active anymore
        }

        //blinking
        if(led2_blink > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led2_active = activate_free_timer(1, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated
                led2_blink = activated_led2[0];
                if (led2_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D2
                P1OUT ^= BIT6;
            }

