fraserb99/ee579-msp430/Group Project/main.c
        } else if (led2_blink == -2){
            led2_active = 0;
            P1OUT &= ~ BIT6;
            deactivate_timer(activated_led2, 1);
            led2_blink = -1;
        }

        //fade in
        if(led2_fade_in > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_2, duty_cycle_2};
                led2_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_in = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to 1
                    light_flag_2 = 1;
                }

            }

        } else if (led2_fade_in == -2){
            led2_active = 0;
            P1DIR &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_fade_in = -1;
        }

        //fade out
        if(led2_fade_out > -1){
            if(!led2_active){
                P1DIR |= BIT6;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_2, duty_cycle_2};
                led2_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_out = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to -1
                    light_flag_2 = -1;
                }

            }

        } else if (led2_fade_out == -2){
            led2_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led2, 2);
            led2_fade_out = -1;
        }

        //breathing
        if(led2_breath > -1){
            if(!led2_active){
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {duty_cycle_2, duty_cycle_2};
                led2_active = activate_free_timer(2, counts);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_breath = get_timer_code(activated_led1);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                } else { //all fine, set light flag to 1
                    light_flag_2 = 1;
                }

            }

        } else if (led2_breath == -2){
            led2_active = 0;
            P1DIR &= ~BIT0;
            deactivate_timer(activated_led2, 2);
            led2_breath = -1;
        }

        //LED3 on/off
        if(led3_on){
            if (!led3_active) {
              P2DIR |= BIT1 + BIT3 + BIT5;        // P1.0 output
              //LED D3, on set colour
              P2OUT = colours[colour];
            }

        } else if(led3_on == -1){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_active = 0;                    //not active anymore
        }

        //circling
        if(led3_rot > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_rot = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, wanted colour
                P2OUT = colours[colour];
            }

        } else if(led3_rot == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_rot = -1;

        }

        //blinking
        if(led3_blink > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_blink = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, with start colour
                P2OUT = colours[colour];
                //indicate on
                led3_blink_on = 1;
            }

        } else if(led3_blink == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_blink = -1;

        }
    }

}

//interrupts
//timer A0
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
    if(button == 0){ //check that it is the button debouncing
       if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
            timerCount = 0;                     //Reset the timer count
            pressed = 0;                        //reset pressed
            held = 1;                           //Button is being held
            P1OUT ^= BIT6;

       } else {
           pressed = 0;                         //Button is not being pressed
       }
       //offset TA0CCR0 by the count number/period
       TA0CCR0 += count_b;
    }
    //check for how long button was pressed
    if ((button == 0) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timerCount += 1;

        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            //send timer count signal here
            //testing with light first
            P1OUT ^= BIT0;
            held = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA0CCR0 += count_b;
    }

    //thermometer stuff
    if(thermometer == 0){
        if (!stable){
            stable = 1;
            //get original value, if possible here
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            temp = ADC10MEM;
            // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
            orig_temp = ((temp - 673) * 423) / 1024;

        } else {
            sample_temp = 1;        //start a sample
        }

        TA0CCR0 += sample_temp_time;
    }

