fraserb99/ee579-msp430/Group Project/main.c
    //outputs
    //LED1 blinking
    if(led1_blink == 0){
        P1OUT ^= BIT0;
        TA0CCR0 += blink_rate_1;
    }

    //fading in, part 1, based on breathing light code from Maddie
    if((led1_fade_in == 10) || (led1_fade_in == 11) || (led1_fade_in == 12) || (led1_fade_in == 13) || (led1_fade_in == 14)){
        if (flash_count_1 < brightness_1){
            P1OUT |= BIT0;
        } else {
            P1OUT &= ~BIT0;
        }
        flash_count_1++;

        if (flash_count_1 >= 4){
            flash_count_1 = 0;
        }

        TA0CCR0 += duty_cycle_1;
    }


    //LED2 blinking
    if(led2_blink == 0){
        P1OUT ^= BIT6;
        TA0CCR0 += blink_rate_2;
    }

    //LED3 rotating
    if(led3_rot == 0){
        //verify boundaries
        if ((colour == 0) && (led3_dir == -1)){
            colour = 6;
        } else if ((colour == 6) && (led3_dir == 1)){
            colour = 0;
        } else {
            colour = colour + led3_dir; //change colour based on direction
        }
        //swap colour
        P2OUT = colours[colour];
        TA0CCR0 += blink_rate_3;
    }
    //LED3 blink
    if(led3_blink == 0){
        if(led3_blink_on){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_blink_on = 0;
            TA0CCR0 += blink_rate_3;
        } else {
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            led3_blink_on = 1;
            //swap colour
            P2OUT = colours[colour];
            TA0CCR0 += blink_rate_3;
        }
    }
}

//interrupt for timer A0
#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1(void){
    switch(TA0IV)
    {
    case  2:
        if(button == 1){ //check that it is the button debouncing
           if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                timerCount = 0;                     //Reset the timer count
                pressed = 0;                        //reset pressed
                held = 1;                           //Button is being held
                P1OUT ^= BIT6;

           } else {
               pressed = 0;                         //Button is not being pressed
           }
           //offset TA0CCR0 by the count number/period
           TA0CCR1 += count_b;
        }
        //check for how long button was pressed
        if ((button == 1) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timerCount += 1;

            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                //testing with light first
                P1OUT ^= BIT0;
                held = 0;                               //button has now been released
            }
            //offset TA0CCR0 by the count number/period
            TA0CCR1 += count_b;
        }

        //thermometer stuff
        if(thermometer == 1){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA0CCR1 += sample_temp_time;
        }

        //outputs
        //LED1 blinking
        if(led1_blink == 1){
            P1OUT ^= BIT0;
            TA0CCR1 += blink_rate_1;
        }

        //fading in, part 1, based on breathing light code from Maddie
        if((led1_fade_in == 15) || (led1_fade_in == 16) || (led1_fade_in == 17) || (led1_fade_in == 18)){
            if (flash_count_1 < brightness_1){
                P1OUT |= BIT0;
            } else {
                P1OUT &= ~BIT0;
            }
            flash_count_1++;

            if (flash_count_1 >= 4){
                flash_count_1 = 0;
            }

            TA0CCR1 += duty_cycle_1;
        }

        //fade in part 2,
        if(led1_fade_in == 10){
            if (light_flag_1 == 1){
                brightness_1++;
            }
            /*else {
                brightness_1--;
            }*/

            if (brightness_1 == 4){            // If max brightness
                //light_flag_1 = -1;             // Set to decrease
                led1_fade_in = 1;
            }
            /*else if (brightness_1 == 0){
                light_flag_1 = 1;
            }*/

            TA0CCR1 = TAR + 32; //TODO: Need to change this number to a variable
        }


        //LED2 blinking
        if(led2_blink == 1){
            P1OUT ^= BIT6;
            TA0CCR1 += blink_rate_2;
        }

        //LED3 rotating
        if(led3_rot == 1){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA0CCR1 += blink_rate_3;
        }
        //LED3 blink
        if(led3_blink == 1){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                TA0CCR1 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA0CCR1 += blink_rate_3;
            }
        }
        break;
    case 4:
        if(button == 2){ //check that it is the button debouncing
           if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                timerCount = 0;                     //Reset the timer count
                pressed = 0;                        //reset pressed
                held = 1;                           //Button is being held
                P1OUT ^= BIT6;

           } else {
               pressed = 0;                         //Button is not being pressed
           }
           //offset TA0CCR0 by the count number/period
           TA0CCR2 += count_b;
        }
        //check for how long button was pressed
        if ((button == 2) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timerCount += 1;

            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                //testing with light first
                P1OUT ^= BIT0;
                held = 0;                               //button has now been released
            }
            //offset TA0CCR0 by the count number/period
            TA0CCR2 += count_b;
        }

        //thermometer stuff
        if(thermometer == 2){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA0CCR2 += sample_temp_time;
        }

