fraserb99/ee579-msp430/Group Project/main.c
            //outputs
            //LED1 blinking
            if(led1_blink == 4){
                P1OUT ^= BIT0;
                TACCR1 += blink_rate_1;
            }

            //fading in, part 1, based on breathing light code from Maddie
            if(led1_fade_in == 24){
                if (flash_count_1 < brightness_1){
                    P1OUT |= BIT0;
                } else {
                    P1OUT &= ~BIT0;
                    led1_fade_in = -2;
                }
                flash_count_1++;

                if (flash_count_1 >= 4){
                    flash_count_1 = 0;
                }

                TA1CCR1 += duty_cycle_1;
            }

            //fade in part 2,
            if((led1_fade_in == 13) || (led1_fade_in == 17) || (led1_fade_in == 20) || (led1_fade_in == 22)){
                if (light_flag_1 == 1){
                    brightness_1++;
                }
                else {
                    brightness_1--;
                }

                if (brightness_1 == 4){            // If max brightness
                    light_flag_1 = -1;             // Set to decrease
                }
                else if (brightness_1 == 0){
                    light_flag_1 = -1;
                }

                TA1CCR1 += 32; //TODO: Need to change this number to a variable
            }

            //LED2 blinking
            if(led2_blink == 4){
                P1OUT ^= BIT6;
                TA1CCR1 += blink_rate_2;
            }

            //LED3 rotating
            if(led3_rot == 4){
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                //swap colour
                P2OUT = colours[colour];
                TA1CCR1 += blink_rate_3;
            }
            //LED3 blink
            if(led3_blink == 4){
                if(led3_blink_on){
                    P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                    led3_blink_on = 0;
                    TA1CCR1 += blink_rate_3;
                } else {
                    if ((colour == 0) && (led3_dir == -1)){
                        colour = 6;
                    } else if ((colour == 6) && (led3_dir == 1)){
                        colour = 0;
                    } else {
                        colour = colour + led3_dir; //change colour based on direction
                    }
                    led3_blink_on = 1;
                    //swap colour
                    P2OUT = colours[colour];
                    TA1CCR1 += blink_rate_3;
                }
            }
            break;
    case 4:
        if(button == 5){ //check that it is the button debouncing
           if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                timerCount = 0;                     //Reset the timer count
                pressed = 0;                        //reset pressed
                held = 1;                           //Button is being held
                P1OUT ^= BIT6;

           } else {
               pressed = 0;                         //Button is not being pressed
           }
           //offset TA0CCR0 by the count number/period
           TA1CCR2 += count_b;
        }
        //check for how long button was pressed
        if ((button == 5) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timerCount += 1;

            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                //testing with light first
                P1OUT ^= BIT0;
                held = 0;                               //button has now been released
            }
            //offset TA0CCR0 by the count number/period
            TA1CCR2 += count_b;
        }

        //thermometer stuff
        if(thermometer == 5){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA1CCR2 += sample_temp_time;
        }
        //outputs
        //LED1 blinking
        if(led1_blink == 5){
            P1OUT ^= BIT0;
            TA1CCR2 += blink_rate_1;
        }

        //fade in part 2,
        if((led1_fade_in == 14) || (led1_fade_in == 18) || (led1_fade_in == 21) || (led1_fade_in == 23) || (led1_fade_in == 24)){
            if (light_flag_1 == 1){
                brightness_1++;
            }
            else {
                brightness_1--;
            }

            if (brightness_1 == 4){            // If max brightness
                light_flag_1 = -1;             // Set to decrease
            }
            else if (brightness_1 == 0){
                light_flag_1 = -1;
            }

            TA1CCR2 += 32; //TODO: Need to change this number to a variable
        }

        //LED2 blinking
        if(led2_blink == 5){
            P1OUT ^= BIT6;
            TA1CCR2 += blink_rate_2;
        }

        //LED3 rotating
        if(led3_rot == 5){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA1CCR2 += blink_rate_3;
        }
        //LED3 blink
        if(led3_blink == 5){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                TA1CCR2 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA1CCR2 += blink_rate_3;
            }
        }
        break;


    case 10: break;                             //Timer_A3 overflow, don't need to do anything

