fraserb99/ee579-msp430/Group Project/main.c
    }

}

//Interrupt for the button, based on the slides/previous task
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void){
    //if it was the button that was pressed
    if(P1IFG & BIT3){
        pressed = 1;                            //Turn on flag for debouncer/check if button was pressed properly
        //debouncer timer, based on current count, check which one was used
        switch(button){
        case 0:
            TA0CCR0 = TAR + debounce_b;         //Current count plus the wanted debounce part
            break;
        case 1:
            TA0CCR1 = TAR + debounce_b;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b;
            break;
        }

        P1IFG &= ~BIT3;                             //clear flag
    }


}


//Helper functions
//function for activating a specific timer
int activate_timer(int timer_no, int count1, int count2){
    if(timer_no == 0){
        TA0CTL = TASSEL_1 + MC_2 + ID_3 +TAIE;          // ACLK, continuous mode, interrupt enabled
        TA0CCTL0 |= CCIE;                         // TA0CCR0 interrupt enabled
        if(count2 > 0){
            TA0CCTL1 |= CCIE;                         // TA0CCR1 interrupt enabled
            TA0CCR0 = count1;
            TA0CCR1 = count2;
            //set them to being used
            timers_used[0] = count1;
            timers_used[1] = count2;
        } else {
            TA0CCR0 = count1;

            timers_used[0] = count1;
        }
        timer0_activated = 1;
        return 1;
    } else if (timer_no == 1){
        TA1CTL = TASSEL_1 + MC_2 + ID_3 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA1CCTL0 |= CCIE;
        if(count2 > 0){
            TA1CCTL1 |= CCIE;
            TA1CCR0 = count1;
            TA1CCR1 = count2;

            timers_used[3] = count1;
            timers_used[4] = count2;
        } else {
            TA1CCR0 = count1;
            timers_used[3] = count1;
        }

        timer1_activated = 1;
        return 1;
    }

    return 0;

}

//function for checking which timer is free,
int activate_free_timer(int registers, int counts[]){
    //check which registers are free, if less than the register amount, return error
    int free[6] = {};
    unsigned int index = 0;
    unsigned int i;
    for(i=0; i < 6; i++){
       if((timers_used[i] == 0) || (timers_used[i] == counts[index])){
           free[index] = i;
           index++;
       }

    }
    //reset activated timers
    for(i=0; i<3; i++){
        activated_timers[i] = -1;
    }


    if(index < registers){
        //return error
        return 0;
    } else { //right number was found, activate them
        for (i=0; i < registers + 1; i++){
            switch (free[i]){
            case 0:
                //activate register A0_0, check if A0 is already active
                if(!timer0_activated){
                    activate_timer(0, counts[i], 0);
                } else if(timers_used[0] == 0) {
                    TA0CCTL0 |= CCIE;
                    TA0CCR0 = counts[i];
                } //if timer was used continue

                //set it as active
                timers_used[0] = counts[i];
                //set it as activated
                activated_timers[i] = 0;
                break;
            case 1:
                //activate A0_1
                //if A0_0 wasn't available then A0 was already activated so don't need to check again
                if(timers_used[1] == 0){
                    TA0CCTL1 |= CCIE;
                    TA0CCR1 = counts[i];
                }
                //set it as active
                timers_used[1] = counts[i];
                //set it as activated
                activated_timers[i] = 1;
                break;
            case 2:
                //activate A0_2
                if(timers_used[2] == 0){
                    TA0CCTL2 |= CCIE;
                    TA0CCR2 = counts[i];
                }
                //set it as active
                timers_used[2] = counts[i];
                //set it as activated
                activated_timers[i] = 2;
                break;
            case 3:
                //activate A1_0check if A1 is already active
                if(!timer1_activated){
                    activate_timer(1, counts[i], 0);
                } else if(timers_used[3] == 0) {
                    TA1CCTL0 |= CCIE;
                    TA1CCR0 = counts[i];
                }
                //set it as active
                timers_used[3] = counts[i];
                //set it as activated
                activated_timers[i] = 3;
                break;
            case 4:
                //activate A1_1
                if(timers_used[4] == 0){
                   TA1CCTL1 |= CCIE;
                   TA1CCR1 = counts[i];
                }

                //set it as active
                timers_used[4] = counts[i];
                //set it as activated
                activated_timers[i] = 4;
                break;
            case 5:
                //activate A1_2
                if(timers_used[4] == 0){
                    TA1CCTL2 |= CCIE;
                    TA1CCR2 = counts[i];
                }
                //set it as active
                timers_used[5] = counts[i];
                //set it as activated
                activated_timers[i] = 5;
                break;
            default:
                return 0;
            }
        }
        return 1;
    }

}

//function to turn off the timers activated - or set the count value to 0, check if each value is now zero so the full timer should be turned off
void deactivate_timer(int activated[], int len){
    unsigned int i;
    for(i=0; i < len; i++){
        int deactivate = activated[i];

        switch (deactivate){ //deactivate specific timer count register
        case 0:
            TA0CCR0 = 0;
            timers_used[0] = 0;
            break;
        case 1:
            TA0CCR1 = 0;
            timers_used[1] = 0;
            break;
        case 2:
            TA0CCR2 = 0;
            timers_used[2] = 0;
            break;
        case 3:
            TA1CCR0 = 0;
            timers_used[3] = 0;
            break;
        case 4:
            TA1CCR1 = 0;
            timers_used[4] = 0;
            break;
        case 5:
            TA1CCR2 = 0;
            timers_used[5] = 0;
            break;
        }
    }

    //check if all timers for A0 are 0
    int all_0 = 0;
    for(i=0; i<3; i++){
        if(timers_used[i] == 0){
            all_0++;
        }
    }

