fraserb99/ee579-msp430/Group Project/main.c
    if(all_0 == 3){
        TA0CTL = MC_0;      //turn off A0
        timer0_activated = 0;
    }

    //check if all registers for A1 is 0
    int all_1 = 0;
        for(i=3; i<6; i++){
            if(timers_used[i] == 0){
                all_1++;
            }
        }

        if(all_1 == 3){
            TA1CTL = MC_0;      //turn off A0
            timer1_activated = 0;
        }
}

//Grab the correct code for the timers
int get_timer_code(int timers[]){
    int first = timers[0];
    int second = timers[1];

    switch (first){ //check which timer is first
            case 0:
                //get second value
                switch(second){
                case 1:
                    return 10;
                case 2:
                    return 11;
                case 3:
                    return 12;
                case 4:
                    return 13;
                case 5:
                    return 14;
                }
                break;
            case 1:
                //get second value
                switch(second){
                case 2:
                    return 15;
                case 3:
                    return 16;
                case 4:
                    return 17;
                case 5:
                    return 18;
                }
                break;
            case 2:
                //get second value
                switch(second){
                case 3:
                    return 19;
                case 4:
                    return 20;
                case 5:
                    return 21;
                }
                break;
            case 3:
                //get second value
                if(second == 4){
                    return 22;
                } else if (second == 5){
                    return 23;
                }
                break;
            case 4:
                if(second == 5){
                    return 24;
                }
                break;
            }
    return 0; //error occurred.
}



